RSC:
* https://s3.amazonaws.com/assets.datacamp.com/blog_assets/PandasPythonForDataScience.pdf
* https://pandas.pydata.org/pandas-docs/version/0.22.0/10min.html
* https://realpython.com/python-data-cleaning-numpy-pandas/

## PANDAS : Python Data Analysis Library
مكتبة بايثون لتحليل البيانات 

The Pandas library is built on NumPy and provides easy-to-use
data structures and data analysis tools for the Python
programming language

مكتبة بانداس هي مبنية على مكتبة نامباي و توفر هياكل بنيوية سهلة الاستعمال و أدوات لتحليل البيانات من أجل البرمجة باستعمال لغة بايثون

https://pandas.pydata.org/

In [3]:
import pandas as pd


The pandas series object can be seen as an enhanced numpy 1D array and the pandas dataframe can be seen as an enhanced numpy 2D array. The main difference is that pandas series and pandas dataframes has explicit index, while numpy arrays has implicit indexation. So, in any python code that you think to use something like

import numpy as np
a = np.array([1,2,3])
you can just use

import pandas as pd
a = pd.Series([1,2,3])
All the functions and methods from numpy arrays will work with pandas series. In analogy, the same can be done with dataframes and numpy 2D arrays.

A further question you might have can be about the performance differences between a numpy array and pandas series. Here is a post that shows the differences in performance using these two tools: performance of pandas series vs numpy arrays.

Please note that even in a explicy way pandas series has a subtle worse in performance when compared to numpy, you can solve this by just calling the values method on a pandas series:

a.values
The result of apply the values method on a pandas series will be a numpy array!

Why is Pandas so much slower than NumPy? The short answer is that Pandas is doing a lot of stuff when you index into a Series, and it’s doing that stuff in Python

## <center style = "color:red"> series </center>

A one-dimensional labeled array a capable of holding any data type 
* pandas create a default integer index

In [32]:
s = pd.Series(
    [3, -5, 7, 4]
)

In [33]:
s

0    3
1   -5
2    7
3    4
dtype: int64

In [34]:
type(s)

pandas.core.series.Series

In [28]:
# Get one element
s[0]

3

### index of string

In [38]:
s = pd.Series(
    [3, -5, 7, 4], 
    index=['a', 'b', 'c', 'd']
)

In [5]:
s['b']

-5

In [30]:
# Drop values from rows (axis=0)
s.drop(['a', 'c'])

b   -5
d    4
dtype: int64

### index of dates

In [2]:
dates = pd.date_range('20130101', periods=6)
dates

NameError: name 'pd' is not defined

In [ ]:
col_list = ['col1','col2','col3','col4']

In [ ]:
df = pd.DataFrame(np.random.randn(6, 4), 
                  index=dates, 
                  columns=col_list)
df

### Boolean Indexing

In [35]:
# Series s where value is >1
s[s > 1]

0    3
2    7
3    4
dtype: int64

In [ ]:
# Series s where value is not >1
s[~(s > 1)]

In [ ]:
# s where value is <-1 or >2
s[(s < -1) | (s > 2)]

In [ ]:
# Setting
s['a'] = 6 # Set index a of Series s to 6

### Data Alignment

In [40]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [43]:

s2 = pd.Series([7, -2, 3, 5], index=['a', 'c', 'd','e'])
s2

a    7
c   -2
d    3
e    5
dtype: int64

### add

In [44]:
s.add(s2, fill_value=0)

a    10.0
b    -5.0
c     5.0
d     7.0
e     5.0
dtype: float64

### sub

In [1]:
s.sub(s2, fill_value=0)

NameError: name 's' is not defined

In [46]:
s.sub(s3, fill_value=2)

a   -4.0
b   -7.0
c    9.0
d    1.0
e   -3.0
dtype: float64

### div

In [47]:
s.div(s3, fill_value=4)

a    0.428571
b   -1.250000
c   -3.500000
d    1.333333
e    0.800000
dtype: float64

### mul

In [48]:
s.mul(s3, fill_value=0)

a    21.0
b   -15.0
c   -14.0
d    12.0
e    15.0
dtype: float64

## <center style = "color:red"> Data Frame </center>

A two-dimensional labeled data structure with columns of potentially different types

### Create a dataframe from a dictionary

In [21]:
data = {
    'Country': ['Morocco', 'China', 'France','Indonesia','Spain'],
    'Capital': ['Rabat', 'Beijing', 'Paris','Jakarta','Madrid'],
    'Population': [30000000, 1000000000, 80000000,130000000,75000000]
}

df = pd.DataFrame(
    data,
    columns=['Country', 'Capital', 'Population']
)

In [22]:
df

     Country  Capital  Population
0    Morocco    Rabat    30000000
1      China  Beijing  1000000000
2     France    Paris    80000000
3  Indonesia  Jakarta   130000000
4      Spain   Madrid    75000000

In [ ]:
df.head(10)

In [ ]:
df.tail(3)

In [61]:
df.info() # Info on DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Country       3 non-null object
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [ ]:
print(df.index)
print(df.columns)

In [ ]:
df.shape # (rows,columns)
df.count() # Number of non-NA values

In [69]:
df.describe() # Summary statistics

         Population
count  3.000000e+00
mean   3.700000e+08
std    5.461685e+08
min    3.000000e+07
25%    5.500000e+07
50%    8.000000e+07
75%    5.400000e+08
max    1.000000e+09

### Data frame selection & filtering

In [6]:
df['Country']

0    Morocco
1      China
2     France
Name: Country, dtype: object

In [7]:
df[['Country','Population']]

   Country  Population
0  Morocco    30000000
1    China  1000000000
2   France    80000000

In [52]:
df[df['Population']>60000000] # Use filter to adjust DataFrame

  Country  Capital  Population
1   China  Beijing  1000000000
2  France    Paris    80000000

In [9]:
# Getting element  
df[:] # Get subset of a DataFram

   Country  Capital  Population
0  Morocco    Rabat    30000000
1    China  Beijing  1000000000
2   France    Paris    80000000

In [10]:
# Getting element  
df[1:] # Get subset of a DataFram

  Country  Capital  Population
1   China  Beijing  1000000000
2  France    Paris    80000000

### loc

In [19]:
df.loc[0]

Country        Morocco
Capital          Rabat
Population    30000000
Name: 0, dtype: object

In [13]:
# By Label
df.loc[[0], ['Country']] #Select single value by row &column labels

   Country
0  Morocco

In [15]:
# By Label
df.loc[:, ['Population']] #Select single value by row &column labels

   Country  Capital  Population
0  Morocco    Rabat    30000000
1    China  Beijing  1000000000
2   France    Paris    80000000

#### iloc (index location)

In [17]:
# By Position
df.iloc[0,0] # Select single value by row & column

'Morocco'

In [26]:
# By Position
df.iloc[1:4,[0,1]] # Select single value by row & column

     Country  Capital
1      China  Beijing
2     France    Paris
3  Indonesia  Jakarta

### Dropping columns/rows

In [24]:
#Dropping
df.drop('Country', axis=1) # Drop values from columns(axis=1)

   Capital  Population
0    Rabat    30000000
1  Beijing  1000000000
2    Paris    80000000

#### Sort & Rank

In [53]:
df.sort_index() #Sort by labels along an axis

   Country  Capital  Population
0  Morocco    Rabat    30000000
1    China  Beijing  1000000000
2   France    Paris    80000000

In [54]:
# Sort by the values along an axis
df.sort_values(by='Country')

   Country  Capital  Population
1    China  Beijing  1000000000
2   France    Paris    80000000
0  Morocco    Rabat    30000000

In [55]:
# Assign ranks to entries
df.rank()

   Country  Capital  Population
0      3.0      3.0         1.0
1      1.0      1.0         3.0
2      2.0      2.0         2.0

In [28]:
df['Population_rank'] = df['Population'].rank()
df

     Country  Capital  Population  country_rank  Population_rank
0    Morocco    Rabat    30000000           4.0              1.0
1      China  Beijing  1000000000           1.0              5.0
2     France    Paris    80000000           2.0              3.0
3  Indonesia  Jakarta   130000000           3.0              4.0
4      Spain   Madrid    75000000           5.0              2.0

### Summary

### sum

In [63]:
df.sum() # Sum of values

Country       MoroccoChinaFrance
Capital        RabatBeijingParis
Population            1110000000
dtype: object

### cumsum

In [64]:
df.cumsum() # Cummulative sum of values

              Country            Capital  Population
0             Morocco              Rabat    30000000
1        MoroccoChina       RabatBeijing  1030000000
2  MoroccoChinaFrance  RabatBeijingParis  1110000000

###  min and max

In [66]:
df["Population"].min()/df["Population"].max() # Minimum/maximum values

0.03

### idxmin and idxmax

In [67]:
df.idxmin()/df.idxmax() # Minimum/Maximum index value

TypeError: reduction operation 'argmin' not allowed for this dtype

## mean & median

In [ ]:
df.mean() # Mean of values

In [ ]:
df.median() # Median of values

### Applying Functions

In [70]:
f = lambda x: x*2

In [71]:
df.apply(f) # Apply function

          Country         Capital  Population
0  MoroccoMorocco      RabatRabat    60000000
1      ChinaChina  BeijingBeijing  2000000000
2    FranceFrance      ParisParis   160000000

In [72]:
df.applymap(f) # Apply function element-wise

          Country         Capital  Population
0  MoroccoMorocco      RabatRabat    60000000
1      ChinaChina  BeijingBeijing  2000000000
2    FranceFrance      ParisParis   160000000

In [1]:
df['Population'].apply(lambda x:x/3+1) # Apply function

NameError: name 'df' is not defined

In [ ]:
df['Population'] # didn't change ?!

### create a new column

In [ ]:
df['new_column'] = df['Population'].apply(lambda x:x/3+1) # Apply function

In [ ]:
df

### create dataframe from a file (Ex: csv)

In [ ]:
df = pd.read_csv("DataScienceInArabic\\data\\Fire_Department_Calls_for_Service_03_23_2019.csv")
df

In [ ]:

df = pd.excel_file("DataScienceInArabic\\data\\Fire_Department_Calls_for_Service_03_23_2019.csv")
df

In [ ]:
df.to_numpy()